const express = require('express'),
  mysql = require('mysql'),
  dbConfig = require('../db_config'),
  path = require('path');

const router = express.Router();
const connection = mysql.createConnection(dbConfig);

function getTags(data) {
  let tagObj = [];
  for (let i = 0; i < data.length; i++) {
    tagObj.push({
      name: data.title,
      url: '/tag/' + data.tag_id
    })
  }
  return tagObj;
}
router.post('/tagList', function (req, res, next) {
  connection.query('SELECT id, title as tagName from tag', function (err, results) {
    if (err) next(err);
    res.send(results);
  })
})

router.post('/articleList', function (req, res, next) {
  console.log('获取文章列表')
  const data = req.body;
  connection.query(`
    SELECT a.id, a.content, a.title, a.view, date_format(a.time, '%Y-%d-%m %H:%i') as time , group_concat(t.id) as tag_id, group_concat(t.title) as tag_title
    FROM
      article a,
      article_tag r,
      tag t
    WHERE
      a.id = r.article_id AND t.id = r.tag_id group by a.id;`, function (err, results) {
      if (err) next(err);
      res.send(results);
    })
})

router.post('/articleContent', function (req, res) {
  console.log('获取文章内容')
  const id = req.body.id;
  res.send({
    status: 200,
    html: `<div>${id}</div>`
  });
})
  // res.send({
  //   articles: [{
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "2017.10.11",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }, {
  //     url: "#######",
  //     title: "是打发交水电费了束带结发是的流量束带结发束带结发",
  //     time: "09:00",
  //     click: 123123,
  //     tags: [{
  //       name: "Vue",
  //       url: "#"
  //     }, {
  //       name: "js",
  //       url: "www.baidu.com"
  //     }],
  //     content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
  //   }]
  // });

module.exports = router;