const express = require('express'),
  router = express.Router();

router.post('/articleList', function (req, res, next) {
  res.send({
    articles: [{
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "2017.10.11",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }, {
      url: "#######",
      title: "是打发交水电费了束带结发是的流量束带结发束带结发",
      time: "09:00",
      click: 123123,
      tags: [{
        name: "Vue",
        url: "#"
      }, {
        name: "js",
        url: "www.baidu.com"
      }],
      content: "<p>是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111是打发交水电费了束带结发是的流量束带结发束带结发1111</p>"
    }]
  });
})

module.exports = router;